/*
[문제]
1. 다음에서 빈 부분을 적절히 채우시오.
1 변수의 참조가 유효한 범위를 변수의 ( 유효범위 )라 한다.
2 키워드 (extern )을 사용한 변수 선언은 새로운 변수를 선언하는 것이 아니라 단지 이미
존재하는 전역변수의 유효 범위를 확장한다.
3 변수 선언에서 자료형 앞에 키워드 ( static )을 넣어 정적변수를 선언할 수 있다.
4 함수나 블록에서 정적으로 선언되는 변수는 ( 정적 지역변수 )이다.
5 (정적 전역 )변수는 선언된 파일 내부에서만 참조가 가능한 변수이다.
6 메인 메모리의 영역은 프로그램 실행 과정에서 ( 데이터 ) 영역, ( 스택 ) 영역, 
( 힙 ) 영역의 세 부분으로 나뉜다.
7 ( 힙 )영역은 동적 할당(Dynamic allocation)되는 변수가 할당되는 저장공간이다.
8 해당 파일 내부에서만 변수를 공유하려면 ( 정적 전역 ) 변수를 이용한다.
9 지역 변수는 메모리의 ( 스택 ) 영역에 할당된다.
10 ( 정적 지역 ) 변수는 함수나 블록을 종료해도 메모리에서 제거되지 않고 계속 메모리에 유지
관리되는 특성이 있다.
*/